Rahix/avr-device/vendor/attiny861.atdf
        <register caption="Analog Comparator Control And Status Register A" name="ACSRA" offset="0x28" size="1">
          <bitfield caption="Analog Comparator Disable" mask="0x80" name="ACD"/>
          <bitfield caption="Analog Comparator Bandgap Select" mask="0x40" name="ACBG"/>
          <bitfield caption="Analog Compare Output" mask="0x20" name="ACO"/>
          <bitfield caption="Analog Comparator Interrupt Flag" mask="0x10" name="ACI"/>
          <bitfield caption="Analog Comparator Interrupt Enable" mask="0x08" name="ACIE"/>
          <bitfield caption="Analog Comparator Multiplexer Enable" mask="0x04" name="ACME"/>
          <bitfield caption="Analog Comparator Interrupt Mode Select bits" mask="0x03" name="ACIS" values="ANALOG_COMP_INTERRUPT"/>
        </register>
      </register-group>
      <value-group caption="" name="ANALOG_COMP_INTERRUPT">
        <value caption="Interrupt on Toggle" name="VAL_0x00" value="0x00"/>
        <value caption="Reserved" name="VAL_0x01" value="0x01"/>
        <value caption="Interrupt on Falling Edge" name="VAL_0x02" value="0x02"/>
        <value caption="Interrupt on Rising Edge" name="VAL_0x03" value="0x03"/>
      </value-group>
    </module>
    <module caption="Universal Serial Interface" name="USI">
      <register-group caption="Universal Serial Interface" name="USI">
        <register caption="USI Pin Position" name="USIPP" offset="0x31" size="1" mask="0x01"/>
        <register caption="USI Buffer Register" name="USIBR" offset="0x30" size="1" mask="0xFF" ocd-rw="R"/>
        <register caption="USI Data Register" name="USIDR" offset="0x2F" size="1" mask="0xFF"/>
        <register caption="USI Status Register" name="USISR" offset="0x2E" size="1" ocd-rw="R">
          <bitfield caption="Start Condition Interrupt Flag" mask="0x80" name="USISIF"/>
          <bitfield caption="Counter Overflow Interrupt Flag" mask="0x40" name="USIOIF"/>
          <bitfield caption="Stop Condition Flag" mask="0x20" name="USIPF"/>
          <bitfield caption="Data Output Collision" mask="0x10" name="USIDC"/>
          <bitfield caption="USI Counter Value Bits" mask="0x0F" name="USICNT"/>
        </register>
        <register caption="USI Control Register" name="USICR" offset="0x2D" size="1">
          <bitfield caption="Start Condition Interrupt Enable" mask="0x80" name="USISIE"/>
          <bitfield caption="Counter Overflow Interrupt Enable" mask="0x40" name="USIOIE"/>
          <bitfield caption="USI Wire Mode Bits" mask="0x30" name="USIWM" values="COMM_USI_OP"/>
          <bitfield caption="USI Clock Source Select Bits" mask="0x0C" name="USICS"/>
          <bitfield caption="Clock Strobe" mask="0x02" name="USICLK"/>
          <bitfield caption="Toggle Clock Port Pin" mask="0x01" name="USITC"/>
        </register>
      </register-group>
      <value-group caption="" name="COMM_USI_OP">
        <value caption="Normal Operation" name="VAL_0x00" value="0x00"/>
        <value caption="Three-Wire Mode" name="VAL_0x01" value="0x01"/>
        <value caption="Two-Wire Mode" name="VAL_0x02" value="0x02"/>
        <value caption="Two-Wire Mode Held Low" name="VAL_0x03" value="0x03"/>
      </value-group>
    </module>
    <module caption="EEPROM" name="EEPROM">
      <register-group caption="EEPROM" name="EEPROM">
        <register caption="EEPROM Address Register  Bytes" name="EEAR" offset="0x3E" size="2" mask="0x01FF"/>
        <register caption="EEPROM Data Register" name="EEDR" offset="0x3D" size="1" mask="0xFF"/>
        <register caption="EEPROM Control Register" name="EECR" offset="0x3C" size="1">
          <bitfield caption="EEPROM Programming Mode Bits" mask="0x30" name="EEPM" values="EEP_MODE"/>
          <bitfield caption="EEPROM Ready Interrupt Enable" mask="0x08" name="EERIE"/>
          <bitfield caption="EEPROM Master Write Enable" mask="0x04" name="EEMPE"/>
          <bitfield caption="EEPROM Write Enable" mask="0x02" name="EEPE"/>
          <bitfield caption="EEPROM Read Enable" mask="0x01" name="EERE"/>
        </register>
      </register-group>
      <value-group caption="" name="EEP_MODE">
        <value caption="Erase and Write in one operation" name="VAL_0x00" value="0x00"/>
        <value caption="Erase Only" name="VAL_0x01" value="0x01"/>
        <value caption="Write Only" name="VAL_0x02" value="0x02"/>
      </value-group>
    </module>
    <module caption="Watchdog Timer" name="WDT">
      <register-group caption="Watchdog Timer" name="WDT">
        <register caption="Watchdog Timer Control Register" name="WDTCR" offset="0x41" size="1" ocd-rw="R">
          <bitfield caption="Watchdog Timeout Interrupt Flag" mask="0x80" name="WDIF"/>
          <bitfield caption="Watchdog Timeout Interrupt Enable" mask="0x40" name="WDIE"/>
          <bitfield caption="Watchdog Timer Prescaler Bits" mask="0x27" name="WDP" values="WDOG_TIMER_PRESCALE_4BITS"/>
          <bitfield caption="Watchdog Change Enable" mask="0x10" name="WDCE"/>
          <bitfield caption="Watch Dog Enable" mask="0x08" name="WDE"/>
        </register>
      </register-group>
      <value-group caption="" name="WDOG_TIMER_PRESCALE_4BITS">
        <value caption="Oscillator Cycles 2K" name="VAL_0x00" value="0x00"/>
        <value caption="Oscillator Cycles 4K" name="VAL_0x01" value="0x01"/>
        <value caption="Oscillator Cycles 8K" name="VAL_0x02" value="0x02"/>
        <value caption="Oscillator Cycles 16K" name="VAL_0x03" value="0x03"/>
        <value caption="Oscillator Cycles 32K" name="VAL_0x04" value="0x04"/>
        <value caption="Oscillator Cycles 64K" name="VAL_0x05" value="0x05"/>
        <value caption="Oscillator Cycles 128K" name="VAL_0x06" value="0x06"/>
        <value caption="Oscillator Cycles 256K" name="VAL_0x07" value="0x07"/>
        <value caption="Oscillator Cycles 512K" name="VAL_0x08" value="0x08"/>
        <value caption="Oscillator Cycles 1024K" name="VAL_0x09" value="0x09"/>
      </value-group>
    </module>
    <module caption="Timer/Counter, 8-bit" name="TC8">
      <register-group caption="Timer/Counter, 8-bit" name="TC0">
        <register caption="Timer/Counter Interrupt Mask Register" name="TIMSK" offset="0x59" size="1">
          <bitfield caption="Timer/Counter0 Output Compare Match A Interrupt Enable" mask="0x10" name="OCIE0A"/>
          <bitfield caption="Timer/Counter0 Output Compare Match B Interrupt Enable" mask="0x08" name="OCIE0B"/>
          <bitfield caption="Timer/Counter0 Overflow Interrupt Enable" mask="0x02" name="TOIE0"/>
          <bitfield caption="Timer/Counter0 Input Capture Interrupt Enable" mask="0x01" name="TICIE0"/>
        </register>
        <register caption="Timer/Counter0 Interrupt Flag register" name="TIFR" offset="0x58" size="1" ocd-rw="R">
          <bitfield caption="Timer/Counter0 Output Compare Flag 0A" mask="0x10" name="OCF0A"/>
          <bitfield caption="Timer/Counter0 Output Compare Flag 0B" mask="0x08" name="OCF0B"/>
          <bitfield caption="Timer/Counter0 Overflow Flag" mask="0x02" name="TOV0"/>
          <bitfield caption="Timer/Counter0 Input Capture Flag" mask="0x01" name="ICF0"/>
        </register>
        <register caption="Timer/Counter  Control Register A" name="TCCR0A" offset="0x35" size="1">
          <bitfield caption="Timer/Counter 0 Width" mask="0x80" name="TCW0"/>
          <bitfield caption="Input Capture Mode Enable" mask="0x40" name="ICEN0"/>
          <bitfield caption="Input Capture Noice Canceler" mask="0x20" name="ICNC0"/>
          <bitfield caption="Input Capture Edge Select" mask="0x10" name="ICES0"/>
          <bitfield caption="Analog Comparator Input Capture Enable" mask="0x08" name="ACIC0"/>
          <bitfield caption="Waveform Generation Mode" mask="0x01" name="WGM00"/>
        </register>
        <register caption="Timer/Counter Control Register B" name="TCCR0B" offset="0x53" size="1">
          <bitfield caption="Timer/Counter Synchronization Mode" mask="0x10" name="TSM"/>
          <bitfield caption="Timer/Counter 0 Prescaler Reset" mask="0x08" name="PSR0"/>
          <bitfield caption="Clock Select" mask="0x07" name="CS0" values="CLK_SEL_3BIT_EXT"/>
        </register>
        <register caption="Timer/Counter0 High" name="TCNT0H" offset="0x34" size="1" mask="0xFF"/>
